# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs

#아래의 yaml의 args[0]은 모델의 크기에 따라 width를 곱해줘야함.


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2                                   args = [out_channels, k, s]
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4                            args = [out_channels, k, s, d, g]
  - [-1, 2, C3k2,  [256, False, 0.25]]          #                         args = [out_channels, c3k, e]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8                            args = [out_channels, k, s, d, g]
  - [-1, 2, C3k2,  [512, False, 0.25]]                     #              args = [out_channels, c3k, e]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16                                 args = [out_channels, k, s]
  - [-1, 4, A2C2f, [512, True, 4]] # a2 = True, residual = false  n=2                args = [cout_channels, a2, area]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32                                args = [out_channels, k, s]
  - [-1, 4, A2C2f, [1024, True, 1]] # 8  # a2 = True, residual = false, n=2          args = [cout_channels, a2, area]

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11    # a2 = False, residual = false, n=1     args = [out_channels, a2, area]  -1은 기본값을 의미

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14     # a2 = False, residual = false, n=1     args = [out_channels, a2, area]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17      # a2 = False, residual = false, n=1    args = [out_channels, a2, area]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)                        args = [out_channels, c3k, e]

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
